module.exports = [{
    "name": "安庆市",
    "code": "340800",
    "centerPoint": "117.058739,30.537898"
  },
  {
    "name": "蚌埠市",
    "code": "340300",
    "centerPoint": "117.35708,32.929499"

  },
  {
    "name": "巢湖市",
    "code": "341400",
    "centerPoint": "117.88049,31.608733"
  },
  {
    "name": "池州市",
    "code": "341700",
    "centerPoint": "117.494477,30.660019"
  },
  {
    "name": "滁州市",
    "code": "341100",
    "centerPoint": "118.32457,32.317351"
  },
  {
    "name": "阜阳市",
    "code": "341200",
    "centerPoint": "115.820932,32.901211"
  },
  {
    "name": "合肥市",
    "code": "340100",
    "centerPoint": "117.282699,31.866942"
  },
  {
    "name": "淮北市",
    "code": "340600",
    "centerPoint": "116.791447,33.960023"
  },
  {
    "name": "淮南市",
    "code": "340400",
    "centerPoint": "117.018639,32.642812"
  },
  {
    "name": "黄山市",
    "code": "341000",
    "centerPoint": "118.29357,29.734435"
  },
  {
    "name": "六安市",
    "code": "341500",
    "centerPoint": "116.505253,31.755558"
  },
  {
    "name": "马鞍山市",
    "code": "340500",
    "centerPoint": "118.515882,31.688528"
  },
  {
    "name": "宿州市",
    "code": "341300",
    "centerPoint": "116.988692,33.636772"
  },
  {
    "name": "铜陵市",
    "code": "340700",
    "centerPoint": "117.819429,30.94093"
  },
  {
    "name": "芜湖市",
    "code": "340200",
    "centerPoint": "118.384108,31.36602"
  },
  {
    "name": "宣城市",
    "code": "341800",
    "centerPoint": "118.752096,30.951642"
  },
  {
    "name": "亳州市",
    "code": "341600",
    "centerPoint": "115.787928,33.871211"
  },
  {
    "name": "北京市",
    "code": "110100",
    "centerPoint": "116.395645,39.929986"
  },
  {
    "name": "福州市",
    "code": "350100",
    "centerPoint": "119.330221,26.047125"
  },
  {
    "name": "龙岩市",
    "code": "350800",
    "centerPoint": "117.017997,25.078685"
  },
  {
    "name": "南平市",
    "code": "350700",
    "centerPoint": "118.181883,26.643626"
  },
  {
    "name": "宁德市",
    "code": "350900",
    "centerPoint": "119.542082,26.656527"
  },
  {
    "name": "莆田市",
    "code": "350300",
    "centerPoint": "119.077731,25.44845"
  },
  {
    "name": "泉州市",
    "code": "350500",
    "centerPoint": "118.600362,24.901652"
  },
  {
    "name": "三明市",
    "code": "350400",
    "centerPoint": "117.642194,26.270835"
  },
  {
    "name": "厦门市",
    "code": "350200",
    "centerPoint": "118.103886,24.489231"
  },
  {
    "name": "漳州市",
    "code": "350600",
    "centerPoint": "117.676205,24.517065"
  },
  {
    "name": "白银市",
    "code": "620400",
    "centerPoint": "104.171241,36.546682"
  },
  {
    "name": "定西市",
    "code": "621100",
    "centerPoint": "104.626638,35.586056"
  },
  {
    "name": "甘南藏族自治州",
    "code": "623000",
    "centerPoint": "102.917442,34.992211"
  },
  {
    "name": "嘉峪关市",
    "code": "620200",
    "centerPoint": "98.281635,39.802397"
  },
  {
    "name": "金昌市",
    "code": "620300",
    "centerPoint": "102.208126,38.516072"
  },
  {
    "name": "酒泉市",
    "code": "620900",
    "centerPoint": "98.508415,39.741474"
  },
  {
    "name": "兰州市",
    "code": "620100",
    "centerPoint": "103.823305,36.064226"
  },
  {
    "name": "临夏回族自治州",
    "code": "622900",
    "centerPoint": "103.215249,35.598514"
  },
  {
    "name": "陇南市",
    "code": "621200",
    "centerPoint": "104.934573,33.39448"
  },
  {
    "name": "平凉市",
    "code": "620800",
    "centerPoint": "106.688911,35.55011"
  },
  {
    "name": "庆阳市",
    "code": "621000",
    "centerPoint": "107.644227,35.726801"
  },
  {
    "name": "天水市",
    "code": "620500",
    "centerPoint": "105.736932,34.584319"
  },
  {
    "name": "武威市",
    "code": "620600",
    "centerPoint": "102.640147,37.933172"
  },
  {
    "name": "张掖市",
    "code": "620700",
    "centerPoint": "100.459892,38.93932"
  },
  {
    "name": "潮州市",
    "code": "445100",
    "centerPoint": "116.630076,23.661812"
  },
  {
    "name": "东莞市",
    "code": "441900",
    "centerPoint": "113.763434,23.043024"
  },
  {
    "name": "佛山市",
    "code": "440600",
    "centerPoint": "113.134026,23.035095"
  },
  {
    "name": "广州市",
    "code": "440100",
    "centerPoint": "113.30765,23.120049"
  },
  {
    "name": "河源市",
    "code": "441600",
    "centerPoint": "114.713721,23.757251"
  },
  {
    "name": "惠州市",
    "code": "441300",
    "centerPoint": "114.410658,23.11354"
  },
  {
    "name": "江门市",
    "code": "440700",
    "centerPoint": "113.078125,22.575117"
  },
  {
    "name": "揭阳市",
    "code": "445200",
    "centerPoint": "116.379501,23.547999"
  },
  {
    "name": "茂名市",
    "code": "440900",
    "centerPoint": "110.931245,21.668226"
  },
  {
    "name": "梅州市",
    "code": "441400",
    "centerPoint": "116.126403,24.304571"
  },
  {
    "name": "清远市",
    "code": "441800",
    "centerPoint": "113.040773,23.698469"
  },
  {
    "name": "汕头市",
    "code": "440500",
    "centerPoint": "116.72865,23.383908"
  },
  {
    "name": "汕尾市",
    "code": "441500",
    "centerPoint": "115.372924,22.778731"
  },
  {
    "name": "韶关市",
    "code": "440200",
    "centerPoint": "113.594461,24.80296"
  },
  {
    "name": "深圳市",
    "code": "440300",
    "centerPoint": "114.025974,22.546054"
  },
  {
    "name": "阳江市",
    "code": "441700",
    "centerPoint": "111.97701,21.871517"
  },
  {
    "name": "云浮市",
    "code": "445300",
    "centerPoint": "112.050946,22.937976"
  },
  {
    "name": "湛江市",
    "code": "440800",
    "centerPoint": "110.365067,21.257463"
  },
  {
    "name": "肇庆市",
    "code": "441200",
    "centerPoint": "112.479653,23.078663"
  },
  {
    "name": "中山市",
    "code": "442000",
    "centerPoint": "113.42206,22.545178"
  },
  {
    "name": "珠海市",
    "code": "440400",
    "centerPoint": "113.562447,22.256915"
  },
  {
    "name": "百色市",
    "code": "451000",
    "centerPoint": "106.631821,23.901512"
  },
  {
    "name": "北海市",
    "code": "450500",
    "centerPoint": "109.122628,21.472718"
  },
  {
    "name": "崇左市",
    "code": "451400",
    "centerPoint": "107.357322,22.415455"
  },
  {
    "name": "防城港市",
    "code": "450600",
    "centerPoint": "108.351791,21.617398"
  },
  {
    "name": "桂林市",
    "code": "450300",
    "centerPoint": "110.26092,25.262901"
  },
  {
    "name": "贵港市",
    "code": "450800",
    "centerPoint": "109.613708,23.103373"
  },
  {
    "name": "河池市",
    "code": "451200",
    "centerPoint": "108.069948,24.699521"
  },
  {
    "name": "贺州市",
    "code": "451100",
    "centerPoint": "111.552594,24.411054"
  },
  {
    "name": "来宾市",
    "code": "451300",
    "centerPoint": "109.231817,23.741166"
  },
  {
    "name": "柳州市",
    "code": "450200",
    "centerPoint": "109.422402,24.329053"
  },
  {
    "name": "南宁市",
    "code": "450100",
    "centerPoint": "108.297234,22.806493"
  },
  {
    "name": "钦州市",
    "code": "450700",
    "centerPoint": "108.638798,21.97335"
  },
  {
    "name": "梧州市",
    "code": "450400",
    "centerPoint": "111.305472,23.485395"
  },
  {
    "name": "玉林市",
    "code": "450900",
    "centerPoint": "110.151676,22.643974"
  },
  {
    "name": "安顺市",
    "code": "520400",
    "centerPoint": "105.92827,26.228595"
  },
  {
    "name": "毕节地区",
    "code": "522400",
    "centerPoint": "105.300492,27.302612"
  },
  {
    "name": "贵阳市",
    "code": "520100",
    "centerPoint": "106.709177,26.629907"
  },
  {
    "name": "六盘水市",
    "code": "520200",
    "centerPoint": "104.852087,26.591866"
  },
  {
    "name": "黔东南苗族侗族自治州",
    "code": "522600",
    "centerPoint": "107.985353,26.583992"
  },
  {
    "name": "黔南布依族苗族自治州",
    "code": "522700",
    "centerPoint": "107.523205,26.264536"
  },
  {
    "name": "黔西南布依族苗族自治州",
    "code": "522300",
    "centerPoint": "104.900558,25.095148"
  },
  {
    "name": "铜仁地区",
    "code": "522200",
    "centerPoint": "109.196161,27.726271"
  },
  {
    "name": "遵义市",
    "code": "520300",
    "centerPoint": "106.93126,27.699961"
  },
  {
    "name": "海口市",
    "code": "460100",
    "centerPoint": "110.330802,20.022071"
  },
  {
    "name": "三亚市",
    "code": "460200",
    "centerPoint": "109.522771,18.257776"
  },
  {
    "name": "保定市",
    "code": "130600",
    "centerPoint": "115.49481,38.886565"
  },
  {
    "name": "沧州市",
    "code": "130900",
    "centerPoint": "116.863806,38.297615"
  },
  {
    "name": "承德市",
    "code": "130800",
    "centerPoint": "117.933822,40.992521"
  },
  {
    "name": "邯郸市",
    "code": "130400",
    "centerPoint": "114.482694,36.609308"
  },
  {
    "name": "衡水市",
    "code": "131100",
    "centerPoint": "115.686229,37.746929"
  },
  {
    "name": "廊坊市",
    "code": "131000",
    "centerPoint": "116.703602,39.518611"
  },
  {
    "name": "秦皇岛市",
    "code": "130300",
    "centerPoint": "119.604368,39.945462"
  },
  {
    "name": "石家庄市",
    "code": "130100",
    "centerPoint": "114.522082,38.048958"
  },
  {
    "name": "唐山市",
    "code": "130200",
    "centerPoint": "118.183451,39.650531"
  },
  {
    "name": "邢台市",
    "code": "130500",
    "centerPoint": "114.520487,37.069531"
  },
  {
    "name": "张家口市",
    "code": "130700",
    "centerPoint": "114.893782,40.811188"
  },
  {
    "name": "安阳市",
    "code": "410500",
    "centerPoint": "114.351807,36.110267"
  },
  {
    "name": "鹤壁市",
    "code": "410600",
    "centerPoint": "114.29777,35.755426"
  },
  {
    "name": "焦作市",
    "code": "410800",
    "centerPoint": "113.211836,35.234608"
  },
  {
    "name": "开封市",
    "code": "410200",
    "centerPoint": "114.351642,34.801854"
  },
  {
    "name": "洛阳市",
    "code": "410300",
    "centerPoint": "112.447525,34.657368"
  },
  {
    "name": "南阳市",
    "code": "411300",
    "centerPoint": "112.542842,33.01142"
  },
  {
    "name": "平顶山市",
    "code": "410400",
    "centerPoint": "113.300849,33.745301"
  },
  {
    "name": "三门峡市",
    "code": "411200",
    "centerPoint": "111.181262,34.78332"
  },
  {
    "name": "商丘市",
    "code": "411400",
    "centerPoint": "115.641886,34.438589"
  },
  {
    "name": "新乡市",
    "code": "410700",
    "centerPoint": "113.91269,35.307258"
  },
  {
    "name": "信阳市",
    "code": "411500",
    "centerPoint": "114.085491,32.128582"
  },
  {
    "name": "许昌市",
    "code": "411000",
    "centerPoint": "113.835312,34.02674"
  },
  {
    "name": "郑州市",
    "code": "410100",
    "centerPoint": "113.649644,34.75661"
  },
  {
    "name": "周口市",
    "code": "411600",
    "centerPoint": "114.654102,33.623741"
  },
  {
    "name": "驻马店市",
    "code": "411700",
    "centerPoint": "114.049154,32.983158"
  },
  {
    "name": "漯河市",
    "code": "411100",
    "centerPoint": "114.046061,33.576279"
  },
  {
    "name": "濮阳市",
    "code": "410900",
    "centerPoint": "115.026627,35.753298"
  },
  {
    "name": "大庆市",
    "code": "230600",
    "centerPoint": "125.02184,46.596709"
  },
  {
    "name": "大兴安岭地区",
    "code": "232700",
    "centerPoint": "124.196104,51.991789"
  },
  {
    "name": "哈尔滨市",
    "code": "230100",
    "centerPoint": "126.657717,45.773225"
  },
  {
    "name": "鹤岗市",
    "code": "230400",
    "centerPoint": "130.292472,47.338666"
  },
  {
    "name": "黑河市",
    "code": "231100",
    "centerPoint": "127.50083,50.25069"
  },
  {
    "name": "鸡西市",
    "code": "230300",
    "centerPoint": "130.941767,45.32154"
  },
  {
    "name": "佳木斯市",
    "code": "230800",
    "centerPoint": "130.284735,46.81378"
  },
  {
    "name": "牡丹江市",
    "code": "231000",
    "centerPoint": "129.608035,44.588521"
  },
  {
    "name": "七台河市",
    "code": "230900",
    "centerPoint": "131.019048,45.775005"
  },
  {
    "name": "齐齐哈尔市",
    "code": "230200",
    "centerPoint": "123.987289,47.3477"
  },
  {
    "name": "双鸭山市",
    "code": "230500",
    "centerPoint": "131.171402,46.655102"
  },
  {
    "name": "绥化市",
    "code": "231200",
    "centerPoint": "126.989095,46.646064"
  },
  {
    "name": "伊春市",
    "code": "230700",
    "centerPoint": "128.910766,47.734685"
  },
  {
    "name": "鄂州市",
    "code": "420700",
    "centerPoint": "114.895594,30.384439"
  },
  {
    "name": "恩施土家族苗族自治州",
    "code": "422800",
    "centerPoint": "109.517433,30.308978"
  },
  {
    "name": "黄冈市",
    "code": "421100",
    "centerPoint": "114.906618,30.446109"
  },
  {
    "name": "黄石市",
    "code": "420200",
    "centerPoint": "115.050683,30.216127"
  },
  {
    "name": "荆门市",
    "code": "420800",
    "centerPoint": "112.21733,31.042611"
  },
  {
    "name": "荆州市",
    "code": "421000",
    "centerPoint": "112.241866,30.332591"
  },
  {
    "name": "省直辖行政单位",
    "code": "429000",
    "centerPoint": ""
  },
  {
    "name": "十堰市",
    "code": "420300",
    "centerPoint": "110.801229,32.636994"
  },
  {
    "name": "随州市",
    "code": "421300",
    "centerPoint": "113.379358,31.717858"
  },
  {
    "name": "武汉市",
    "code": "420100",
    "centerPoint": "114.3162,30.581084"
  },
  {
    "name": "咸宁市",
    "code": "421200",
    "centerPoint": "114.300061,29.880657"
  },
  {
    "name": "襄樊市",
    "code": "420600",
    "centerPoint": "112.12255,32.009000"
  },
  {
    "name": "孝感市",
    "code": "420900",
    "centerPoint": "113.935734,30.927955"
  },
  {
    "name": "宜昌市",
    "code": "420500",
    "centerPoint": "111.310981,30.732758"
  },
  {
    "name": "常德市",
    "code": "430700",
    "centerPoint": "111.653718,29.012149"
  },
  {
    "name": "长沙市",
    "code": "430100",
    "centerPoint": "112.979353,28.213478"
  },
  {
    "name": "郴州市",
    "code": "431000",
    "centerPoint": "113.037704,25.782264"
  },
  {
    "name": "衡阳市",
    "code": "430400",
    "centerPoint": "112.583819,26.898164"
  },
  {
    "name": "怀化市",
    "code": "431200",
    "centerPoint": "109.986959,27.557483"
  },
  {
    "name": "娄底市",
    "code": "431300",
    "centerPoint": "111.996396,27.741073"
  },
  {
    "name": "邵阳市",
    "code": "430500",
    "centerPoint": "111.461525,27.236811"
  },
  {
    "name": "湘潭市",
    "code": "430300",
    "centerPoint": "112.935556,27.835095"
  },
  {
    "name": "湘西土家族苗族自治州",
    "code": "433100",
    "centerPoint": "109.745746,28.317951"
  },
  {
    "name": "益阳市",
    "code": "430900",
    "centerPoint": "112.366547,28.588088"
  },
  {
    "name": "永州市",
    "code": "431100",
    "centerPoint": "111.614648,26.435972"
  },
  {
    "name": "岳阳市",
    "code": "430600",
    "centerPoint": "113.146196,29.378007"
  },
  {
    "name": "张家界市",
    "code": "430800",
    "centerPoint": "110.48162,29.124889"
  },
  {
    "name": "株洲市",
    "code": "430200",
    "centerPoint": "113.131695,27.827433"
  },
  {
    "name": "白城市",
    "code": "220800",
    "centerPoint": "122.840777,45.621086"
  },
  {
    "name": "白山市",
    "code": "220600",
    "centerPoint": "126.435798,41.945859"
  },
  {
    "name": "长春市",
    "code": "220100",
    "centerPoint": "125.313642,43.898338"
  },
  {
    "name": "吉林市",
    "code": "220200",
    "centerPoint": "126.564544,43.871988"
  },
  {
    "name": "辽源市",
    "code": "220400",
    "centerPoint": "125.133686,42.923303"
  },
  {
    "name": "四平市",
    "code": "220300",
    "centerPoint": "124.391382,43.175525"
  },
  {
    "name": "松原市",
    "code": "220700",
    "centerPoint": "124.832995,45.136049"
  },
  {
    "name": "通化市",
    "code": "220500",
    "centerPoint": "125.94265,41.736397"
  },
  {
    "name": "延边朝鲜族自治州",
    "code": "222400",
    "centerPoint": "129.485902,42.896414"
  },
  {
    "name": "常州市",
    "code": "320400",
    "centerPoint": "119.981861,31.771397"
  },
  {
    "name": "淮安市",
    "code": "320800",
    "centerPoint": "119.030186,33.606513"
  },
  {
    "name": "连云港市",
    "code": "320700",
    "centerPoint": "119.173872,34.601549"
  },
  {
    "name": "南京市",
    "code": "320100",
    "centerPoint": "118.778074,32.057236"
  },
  {
    "name": "南通市",
    "code": "320600",
    "centerPoint": "120.873801,32.014665"
  },
  {
    "name": "苏州市",
    "code": "320500",
    "centerPoint": "120.619907,31.317987"
  },
  {
    "name": "宿迁市",
    "code": "321300",
    "centerPoint": "118.296893,33.95205"
  },
  {
    "name": "泰州市",
    "code": "321200",
    "centerPoint": "119.919606,32.476053"
  },
  {
    "name": "无锡市",
    "code": "320200",
    "centerPoint": "120.305456,31.570037"
  },
  {
    "name": "徐州市",
    "code": "320300",
    "centerPoint": "117.188107,34.271553"
  },
  {
    "name": "盐城市",
    "code": "320900",
    "centerPoint": "120.148872,33.379862"
  },
  {
    "name": "扬州市",
    "code": "321000",
    "centerPoint": "119.427778,32.408505"
  },
  {
    "name": "镇江市",
    "code": "321100",
    "centerPoint": "119.455835,32.204409"
  },
  {
    "name": "抚州市",
    "code": "361000",
    "centerPoint": "116.360919,27.954545"
  },
  {
    "name": "赣州市",
    "code": "360700",
    "centerPoint": "114.935909,25.845296"
  },
  {
    "name": "吉安市",
    "code": "360800",
    "centerPoint": "114.992039,27.113848"
  },
  {
    "name": "景德镇市",
    "code": "360200",
    "centerPoint": "117.186523,29.303563"
  },
  {
    "name": "九江市",
    "code": "360400",
    "centerPoint": "115.999848,29.71964"
  },
  {
    "name": "南昌市",
    "code": "360100",
    "centerPoint": "115.893528,28.689578"
  },
  {
    "name": "萍乡市",
    "code": "360300",
    "centerPoint": "113.859917,27.639544"
  },
  {
    "name": "上饶市",
    "code": "361100",
    "centerPoint": "117.955464,28.457623"
  },
  {
    "name": "新余市",
    "code": "360500",
    "centerPoint": "114.947117,27.822322"
  },
  {
    "name": "宜春市",
    "code": "360900",
    "centerPoint": "114.400039,27.81113"
  },
  {
    "name": "鹰潭市",
    "code": "360600",
    "centerPoint": "117.03545,28.24131"
  },
  {
    "name": "鞍山市",
    "code": "210300",
    "centerPoint": "123.007763,41.118744"
  },
  {
    "name": "本溪市",
    "code": "210500",
    "centerPoint": "123.778062,41.325838"
  },
  {
    "name": "朝阳市",
    "code": "211300",
    "centerPoint": "120.446163,41.571828"
  },
  {
    "name": "大连市",
    "code": "210200",
    "centerPoint": "121.593478,38.94871"
  },
  {
    "name": "丹东市",
    "code": "210600",
    "centerPoint": "124.338543,40.129023"
  },
  {
    "name": "抚顺市",
    "code": "210400",
    "centerPoint": "123.92982,41.877304"
  },
  {
    "name": "阜新市",
    "code": "210900",
    "centerPoint": "121.660822,42.01925"
  },
  {
    "name": "葫芦岛市",
    "code": "211400",
    "centerPoint": "120.860758,40.74303"
  },
  {
    "name": "锦州市",
    "code": "210700",
    "centerPoint": "121.147749,41.130879"
  },
  {
    "name": "辽阳市",
    "code": "211000",
    "centerPoint": "123.172451,41.273339"
  },
  {
    "name": "盘锦市",
    "code": "211100",
    "centerPoint": "122.073228,41.141248"
  },
  {
    "name": "沈阳市",
    "code": "210100",
    "centerPoint": "123.432791,41.808645"
  },
  {
    "name": "铁岭市",
    "code": "211200",
    "centerPoint": "123.85485,42.299757"
  },
  {
    "name": "营口市",
    "code": "210800",
    "centerPoint": "122.233391,40.668651"
  },
  {
    "name": "阿拉善盟",
    "code": "152900",
    "centerPoint": "105.695683,38.843075"
  },
  {
    "name": "巴彦淖尔市",
    "code": "150800",
    "centerPoint": "107.423807,40.76918"
  },
  {
    "name": "包头市",
    "code": "150200",
    "centerPoint": "109.846239,40.647119"
  },
  {
    "name": "赤峰市",
    "code": "150400",
    "centerPoint": "118.930761,42.297112"
  },
  {
    "name": "鄂尔多斯市",
    "code": "150600",
    "centerPoint": "109.993706,39.81649"
  },
  {
    "name": "呼和浩特市",
    "code": "150100",
    "centerPoint": "111.660351,40.828319"
  },
  {
    "name": "呼伦贝尔市",
    "code": "150700",
    "centerPoint": "119.760822,49.201636"
  },
  {
    "name": "通辽市",
    "code": "150500",
    "centerPoint": "122.260363,43.633756"
  },
  {
    "name": "乌海市",
    "code": "150300",
    "centerPoint": "106.831999,39.683177"
  },
  {
    "name": "乌兰察布市",
    "code": "150900",
    "centerPoint": "113.112846,41.022363"
  },
  {
    "name": "锡林郭勒盟",
    "code": "152500",
    "centerPoint": "116.02734,43.939705"
  },
  {
    "name": "兴安盟",
    "code": "152200",
    "centerPoint": "122.048167,46.083757"
  },
  {
    "name": "固原市",
    "code": "640400",
    "centerPoint": "106.285268,36.021523"
  },
  {
    "name": "石嘴山市",
    "code": "640200",
    "centerPoint": "106.379337,39.020223"
  },
  {
    "name": "吴忠市",
    "code": "640300",
    "centerPoint": "106.208254,37.993561"
  },
  {
    "name": "银川市",
    "code": "640100",
    "centerPoint": "106.206479,38.502621"
  },
  {
    "name": "中卫市",
    "code": "640500",
    "centerPoint": "105.196754,37.521124"
  },
  {
    "name": "果洛藏族自治州",
    "code": "632600",
    "centerPoint": "100.223723,34.480485"
  },
  {
    "name": "海北藏族自治州",
    "code": "632200",
    "centerPoint": "100.879802,36.960654"
  },
  {
    "name": "海东地区",
    "code": "632100",
    "centerPoint": "102.085207,36.51761"
  },
  {
    "name": "海南藏族自治州",
    "code": "632500",
    "centerPoint": "100.624066,36.284364"
  },
  {
    "name": "海西蒙古族藏族自治州",
    "code": "632800",
    "centerPoint": "97.342625,37.373799"
  },
  {
    "name": "黄南藏族自治州",
    "code": "632300",
    "centerPoint": "102.0076,35.522852"
  },
  {
    "name": "西宁市",
    "code": "630100",
    "centerPoint": "101.767921,36.640739"
  },
  {
    "name": "玉树藏族自治州",
    "code": "632700",
    "centerPoint": "97.013316,33.00624"
  },
  {
    "name": "滨州市",
    "code": "371600",
    "centerPoint": "117.968292,37.405314"
  },
  {
    "name": "德州市",
    "code": "371400",
    "centerPoint": "116.328161,37.460826"
  },
  {
    "name": "东营市",
    "code": "370500",
    "centerPoint": "118.583926,37.487121"
  },
  {
    "name": "菏泽市",
    "code": "371700",
    "centerPoint": "115.46336,35.26244"
  },
  {
    "name": "济南市",
    "code": "370100",
    "centerPoint": "117.024967,36.682785"
  },
  {
    "name": "济宁市",
    "code": "370800",
    "centerPoint": "116.600798,35.402122"
  },
  {
    "name": "莱芜市",
    "code": "371200",
    "centerPoint": "117.684667,36.233654"
  },
  {
    "name": "聊城市",
    "code": "371500",
    "centerPoint": "115.986869,36.455829"
  },
  {
    "name": "临沂市",
    "code": "371300",
    "centerPoint": "118.340768,35.072409"
  },
  {
    "name": "青岛市",
    "code": "370200",
    "centerPoint": "120.384428,36.105215"
  },
  {
    "name": "日照市",
    "code": "371100",
    "centerPoint": "119.50718,35.420225"
  },
  {
    "name": "泰安市",
    "code": "370900",
    "centerPoint": "117.089415,36.188078"
  },
  {
    "name": "威海市",
    "code": "371000",
    "centerPoint": "122.093958,37.528787"
  },
  {
    "name": "潍坊市",
    "code": "370700",
    "centerPoint": "119.142634,36.716115"
  },
  {
    "name": "烟台市",
    "code": "370600",
    "centerPoint": "121.309555,37.536562"
  },
  {
    "name": "枣庄市",
    "code": "370400",
    "centerPoint": "117.279305,34.807883"
  },
  {
    "name": "淄博市",
    "code": "370300",
    "centerPoint": "118.059134,36.804685"
  },
  {
    "name": "长治市",
    "code": "140400",
    "centerPoint": "113.120292,36.201664"
  },
  {
    "name": "大同市",
    "code": "140200",
    "centerPoint": "113.290509,40.113744"
  },
  {
    "name": "晋城市",
    "code": "140500",
    "centerPoint": "112.867333,35.499834"
  },
  {
    "name": "晋中市",
    "code": "140700",
    "centerPoint": "112.738514,37.693362"
  },
  {
    "name": "临汾市",
    "code": "141000",
    "centerPoint": "111.538788,36.099745"
  },
  {
    "name": "吕梁市",
    "code": "141100",
    "centerPoint": "111.143157,37.527316"
  },
  {
    "name": "朔州市",
    "code": "140600",
    "centerPoint": "112.479928,39.337672"
  },
  {
    "name": "太原市",
    "code": "140100",
    "centerPoint": "112.550864,37.890277"
  },
  {
    "name": "忻州市",
    "code": "140900",
    "centerPoint": "112.727939,38.461031"
  },
  {
    "name": "阳泉市",
    "code": "140300",
    "centerPoint": "113.569238,37.869529"
  },
  {
    "name": "运城市",
    "code": "140800",
    "centerPoint": "111.006854,35.038859"
  },
  {
    "name": "安康市",
    "code": "610900",
    "centerPoint": "109.038045,32.70437"
  },
  {
    "name": "宝鸡市",
    "code": "610300",
    "centerPoint": "107.170645,34.364081"
  },
  {
    "name": "汉中市",
    "code": "610700",
    "centerPoint": "107.045478,33.081569"
  },
  {
    "name": "商洛市",
    "code": "611000",
    "centerPoint": "109.934208,33.873907"
  },
  {
    "name": "铜川市",
    "code": "610200",
    "centerPoint": "108.968067,34.908368"
  },
  {
    "name": "渭南市",
    "code": "610500",
    "centerPoint": "109.483933,34.502358"
  },
  {
    "name": "西安市",
    "code": "610100",
    "centerPoint": "108.953098,34.2778"
  },
  {
    "name": "咸阳市",
    "code": "610400",
    "centerPoint": "108.707509,34.345373"
  },
  {
    "name": "延安市",
    "code": "610600",
    "centerPoint": "109.50051,36.60332"
  },
  {
    "name": "榆林市",
    "code": "610800",
    "centerPoint": "109.745926,38.279439"
  },
  {
    "name": "上海市",
    "code": "310100",
    "centerPoint": "121.487899,31.249162"
  },
  {
    "name": "上海市",
    "code": "310200",
    "centerPoint": "121.487899,31.249162"
  },
  {
    "name": "阿坝藏族羌族自治州",
    "code": "513200",
    "centerPoint": "102.228565,31.905763"

  },
  {
    "name": "巴中市",
    "code": "511900",
    "centerPoint": "106.757916,31.869189"
  },
  {
    "name": "成都市",
    "code": "510100",
    "centerPoint": "104.067923,30.679943"
  },
  {
    "name": "达州市",
    "code": "511700",
    "centerPoint": "107.494973,31.214199"
  },
  {
    "name": "德阳市",
    "code": "510600",
    "centerPoint": "104.402398,31.13114"
  },
  {
    "name": "甘孜藏族自治州",
    "code": "513300",
    "centerPoint": "101.969232,30.055144"
  },
  {
    "name": "广安市",
    "code": "511600",
    "centerPoint": "106.63572,30.463984"
  },
  {
    "name": "广元市",
    "code": "510800",
    "centerPoint": "105.819687,32.44104"
  },
  {
    "name": "乐山市",
    "code": "511100",
    "centerPoint": "103.760824,29.600958"
  },
  {
    "name": "凉山彝族自治州",
    "code": "513400",
    "centerPoint": "102.259591,27.892393"
  },
  {
    "name": "眉山市",
    "code": "511400",
    "centerPoint": "103.84143,30.061115"
  },
  {
    "name": "绵阳市",
    "code": "510700",
    "centerPoint": "104.705519,31.504701"
  },
  {
    "name": "南充市",
    "code": "511300",
    "centerPoint": "106.105554,30.800965"
  },
  {
    "name": "内江市",
    "code": "511000",
    "centerPoint": "105.073056,29.599462"
  },
  {
    "name": "攀枝花市",
    "code": "510400",
    "centerPoint": "101.722423,26.587571"
  },
  {
    "name": "遂宁市",
    "code": "510900",
    "centerPoint": "105.564888,30.557491"
  },
  {
    "name": "雅安市",
    "code": "511800",
    "centerPoint": "103.009356,29.999716"
  },
  {
    "name": "宜宾市",
    "code": "511500",
    "centerPoint": "104.633019,28.769675"
  },
  {
    "name": "资阳市",
    "code": "512000",
    "centerPoint": "104.63593,30.132191"
  },
  {
    "name": "自贡市",
    "code": "510300",
    "centerPoint": "104.776071,29.359157"
  },
  {
    "name": "泸州市",
    "code": "510500",
    "centerPoint": "105.44397,28.89593"
  },
  {
    "name": "天津市",
    "code": "120100",
    "centerPoint": "117.210813,39.14393"
  },
  {
    "name": "天津市",
    "code": "120200",
    "centerPoint": "117.210813,39.14393"
  },
  {
    "name": "阿里地区",
    "code": "542500",
    "centerPoint": "81.107669,30.404557"
  },
  {
    "name": "昌都地区",
    "code": "542100",
    "centerPoint": "97.185582,31.140576"
  },
  {
    "name": "拉萨市",
    "code": "540100",
    "centerPoint": "91.111891,29.662557"
  },
  {
    "name": "林芝地区",
    "code": "542600",
    "centerPoint": "94.349985,29.666941"
  },
  {
    "name": "那曲地区",
    "code": "542400",
    "centerPoint": "92.067018,31.48068"
  },
  {
    "name": "日喀则地区",
    "code": "542300",
    "centerPoint": "88.891486,29.269023"
  },
  {
    "name": "山南地区",
    "code": "542200",
    "centerPoint": "91.750644,29.229027"
  },
  {
    "name": "阿克苏地区",
    "code": "652900",
    "centerPoint": "80.269846,41.171731"
  },
  {
    "name": "阿勒泰地区",
    "code": "654300",
    "centerPoint": "88.137915,47.839744"
  },
  {
    "name": "巴音郭楞蒙古自治州",
    "code": "652800",
    "centerPoint": "86.121688,41.771362"
  },
  {
    "name": "博尔塔拉蒙古自治州",
    "code": "652700",
    "centerPoint": "82.052436,44.913651"
  },
  {
    "name": "昌吉回族自治州",
    "code": "652300",
    "centerPoint": "87.296038,44.007058"
  },
  {
    "name": "哈密地区",
    "code": "652200",
    "centerPoint": "93.528355,42.858596"
  },
  {
    "name": "和田地区",
    "code": "653200",
    "centerPoint": "79.930239,37.116774"
  },
  {
    "name": "喀什地区",
    "code": "653100",
    "centerPoint": "75.992973,39.470627"
  },
  {
    "name": "克拉玛依市",
    "code": "650200",
    "centerPoint": "84.88118,45.594331"
  },
  {
    "name": "克孜勒苏柯尔克孜自治州",
    "code": "653000",
    "centerPoint": "76.137564,39.750346"
  },
  {
    "name": "省直辖行政单位",
    "code": "659000",
    "centerPoint": ""
  },
  {
    "name": "石河子市",
    "code": "650300",
    "centerPoint": "86.041865,44.308259"
  },
  {
    "name": "塔城地区",
    "code": "654200",
    "centerPoint": "82.974881,46.758684"
  },
  {
    "name": "吐鲁番地区",
    "code": "652100",
    "centerPoint": "89.181595,42.96047"
  },
  {
    "name": "乌鲁木齐市",
    "code": "650100",
    "centerPoint": "87.564988,43.84038"
  },
  {
    "name": "伊犁哈萨克自治州",
    "code": "654000",
    "centerPoint": "81.297854,43.922248"
  },
  {
    "name": "保山市",
    "code": "530500",
    "centerPoint": "99.177996,25.120489"
  },
  {
    "name": "楚雄彝族自治州",
    "code": "532300",
    "centerPoint": "101.529382,25.066356"
  },
  {
    "name": "大理白族自治州",
    "code": "532900",
    "centerPoint": "100.223675,25.5969"
  },
  {
    "name": "德宏傣族景颇族自治州",
    "code": "533100",
    "centerPoint": "98.589434,24.44124"
  },
  {
    "name": "迪庆藏族自治州",
    "code": "533400",
    "centerPoint": "99.713682,27.831029"
  },
  {
    "name": "红河哈尼族彝族自治州",
    "code": "532500",
    "centerPoint": "103.384065,23.367718"
  },
  {
    "name": "昆明市",
    "code": "530100",
    "centerPoint": "102.714601,25.049153"
  },
  {
    "name": "丽江市",
    "code": "530700",
    "centerPoint": "100.229628,26.875351"
  },
  {
    "name": "临沧市",
    "code": "530900",
    "centerPoint": "100.092613,23.887806"
  },
  {
    "name": "怒江傈僳族自治州",
    "code": "533300",
    "centerPoint": "98.859932,25.860677"
  },
  {
    "name": "曲靖市",
    "code": "530300",
    "centerPoint": "103.782539,25.520758"
  },
  {
    "name": "思茅市",
    "code": "530800",
    "centerPoint": "100.581520,22.497460"
  },
  {
    "name": "文山壮族苗族自治州",
    "code": "532600",
    "centerPoint": "104.089112,23.401781"
  },
  {
    "name": "西双版纳傣族自治州",
    "code": "532800",
    "centerPoint": "100.803038,22.009433"
  },
  {
    "name": "玉溪市",
    "code": "530400",
    "centerPoint": "102.545068,24.370447"
  },
  {
    "name": "昭通市",
    "code": "530600",
    "centerPoint": "103.725021,27.340633"
  },
  {
    "name": "杭州市",
    "code": "330100",
    "centerPoint": "120.219375,30.259244"
  },
  {
    "name": "湖州市",
    "code": "330500",
    "centerPoint": "120.137243,30.877925"
  },
  {
    "name": "嘉兴市",
    "code": "330400",
    "centerPoint": "120.760428,30.773992"
  },
  {
    "name": "金华市",
    "code": "330700",
    "centerPoint": "119.652576,29.102899"
  },
  {
    "name": "丽水市",
    "code": "331100",
    "centerPoint": "119.929576,28.4563"
  },
  {
    "name": "宁波市",
    "code": "330200",
    "centerPoint": "121.579006,29.885259"
  },
  {
    "name": "绍兴市",
    "code": "330600",
    "centerPoint": "120.592467,30.002365"
  },
  {
    "name": "台州市",
    "code": "331000",
    "centerPoint": "121.440613,28.668283"
  },
  {
    "name": "温州市",
    "code": "330300",
    "centerPoint": "120.690635,28.002838"
  },
  {
    "name": "舟山市",
    "code": "330900",
    "centerPoint": "122.169872,30.03601"
  },
  {
    "name": "衢州市",
    "code": "330800",
    "centerPoint": "118.875842,28.95691"
  },
  {
    "name": "重庆市",
    "code": "500100",
    "centerPoint": "106.530635,29.544606"
  },
  {
    "name": "香港",
    "code": "",
    "centerPoint": "114.186124,22.293586"
  },
  {
    "name": "澳门",
    "code": "",
    "centerPoint": "113.557519,22.204118"
  }
]